In [1]:
import numpy as np
import pandas as pd

**Pair Programming Pandas VII**

1.- ¿Qué diferencia hay entre una Serie y un DataFrame?

In [2]:
#La serie es unidimensional y el DataFrame tiene 2 dimensiones.

2.- Momento de trabajar con Series. Contestad a las siguientes preguntas:

- Crea dos listas:
 - 1.-  Una que se llame "valores" que tenga 7 números aleatorios.
 - 2.- Otra que se llame "indices" que tenga 7 strings que se llamen como los días de la semana.

In [3]:
valores= [3,5,7,2,6,2,4]
indices = ["lunes", "martes", "miercoles", "jueves", "viernes", "sabado", "domingo"]

 A partir de estas dos listas cread una Serie donde la variable "valores" sean los valores de la Serie y la variable indices sean los índices de la Serie.

In [4]:
serie_lista = pd.Series(valores, indices)
serie_lista
#no entiendo por cruza los valores y los indices. no salen en el orden del parentesis.

lunes        3
martes       5
miercoles    7
jueves       2
viernes      6
sabado       2
domingo      4
dtype: int64

A partir de las dos listas anteriores cread un diccionario usando un bucle for.

Para hacer esto tenemos el método zip que nos permite iterar por dos listas a la vez.

In [15]:
def diccionario_listas():
    for indices, valores in zip(indices, valores):
        print('{}: {}'.format(indices, valores))
        
print(diccionario_listas)

#nos falta poner el nombre del diccionario

<function diccionario_listas at 0x7f97f9fee820>

In [16]:
diccionario_listas = dict(zip(indices, valores))
diccionario_listas

{'lunes': 3,
 'martes': 5,
 'miercoles': 7,
 'jueves': 2,
 'viernes': 6,
 'sabado': 2,
 'domingo': 4}

Crea una Serie con el diccionario creado en el punto anterior.

In [17]:
serie_diccionario = pd.Series(diccionario_listas)
serie_diccionario

lunes        3
martes       5
miercoles    7
jueves       2
viernes      6
sabado       2
domingo      4
dtype: int64

1.- ¿Qué forma tiene esta última Serie?

In [13]:
serie_diccionario.shape

(7,)

2.- ¿Qué tipo de datos tiene?

In [14]:
serie_diccionario.dtype

dtype('int64')

3.- Es el turno de los DataFrames.
Cread un array de dos dimensiones con 4 filas y 3 columnas.

In [ ]:
array = np.random.randint(0,50,(4,3))
array

array([[ 5, 37, 12],
       [47, 13, 21],
       [17, 15, 16],
       [33, 12, 39]])

Convertid el array en un DataFrame donde las columnas se llamen "España", "Francia" e "Italia".

In [ ]:
data_frame = pd.DataFrame (array)
data_frame

    0   1   2
0   5  37  12
1  47  13  21
2  17  15  16
3  33  12  39

4.- Descargad el archivo "medallas" y cargad el DataFrame con la siguiente línea de código:
df = pd.read_csv("medallas.csv",index_col=["País"])

NOTA: Para evitar problemas guardar el archivo medallas.csv a la misma altura (en la misma carpeta) que el jupyter donde estamos trabajando.

In [ ]:
medallas = pd.read_csv("medallas.csv",index_col=["País"])
medallas

                 Unnamed: 0   Oro  Plata  Bronce
País
China                     1  1473    994     720
Japón                     2  1032   1037     985
Corea del Sur             3   745    663     827
Irán                      4   179    181     197
Kazajistán                5   155    158     224
India                     6   154    202     315
Tailandia                 7   132    175     278
Indonesia                 8   112    131     240
China Taipéi              9    99    144     276
Corea del Norte          10    91    120     235

- Usando el loc extraed todas las columnas de la fila China.

In [ ]:
solo_fila_china = medallas.loc[["China"]]
solo_fila_china

       Unnamed: 0   Oro  Plata  Bronce
País
China           1  1473    994     720

- Usando el loc extraed todas las columnas de China e Irán.

In [ ]:
china_iran = medallas.loc[["China", "Irán"]]
china_iran

       Unnamed: 0   Oro  Plata  Bronce
País
China           1  1473    994     720
Irán            4   179    181     197

- Usando el loc extraed solo las columnas de "Oro", "Plata" y "Bronce" de China e Irán.

In [ ]:
china_iran_oroplatabronce = medallas.loc[["China", "Irán"], ["Oro", "Plata", "Bronce"]]
china_iran_oroplatabronce

        Oro  Plata  Bronce
País
China  1473    994     720
Irán    179    181     197

- Usando el iloc extraed la información de la India. Devolved todas las columnas.

In [ ]:
india = medallas.iloc[[5]]
india

       Unnamed: 0  Oro  Plata  Bronce
País
India           6  154    202     315

- Usando el iloc extraed todas las columnas de los paises que estén en posición impar. La primera que nos tendría que salir es Japón y la última Corea del Norte.

In [ ]:
paises_impar = medallas.iloc[1::2]
paises_impar

                 Unnamed: 0   Oro  Plata  Bronce
País
Japón                     2  1032   1037     985
Irán                      4   179    181     197
India                     6   154    202     315
Indonesia                 8   112    131     240
Corea del Norte          10    91    120     235

- Utilizando el código del ejercicio anterior, seleccionad unicamente las columnas "Oro", "Plata" y "Bronce".

In [ ]:
paises_impar_oroplatabronce = medallas.iloc[1::2],["Oro", "Plata", "Bronce"]
paises_impar_oroplatabronce

(                 Unnamed: 0   Oro  Plata  Bronce
 País
 Japón                     2  1032   1037     985
 Irán                      4   179    181     197
 India                     6   154    202     315
 Indonesia                 8   112    131     240
 Corea del Norte          10    91    120     235,
 ['Oro', 'Plata', 'Bronce'])

Contestad a las siguientes preguntas:

¿Qué país consiguió más de 200 medallas de oro?

In [ ]:
mas200_oro = medallas.loc[medallas.Oro > 200, :]
mas200_oro

               Unnamed: 0   Oro  Plata  Bronce
País
China                   1  1473    994     720
Japón                   2  1032   1037     985
Corea del Sur           3   745    663     827

¿Qué país consiguió más de 200 medallas de oro y más de 1000 de plata?

In [ ]:
mas200oro_mas1000plata = medallas.loc[(medallas.Oro > 200) & (medallas.Plata > 1000)]
mas200oro_mas1000plata

       Unnamed: 0   Oro  Plata  Bronce
País
Japón           2  1032   1037     985

¿Qué país consiguió más de 200 medallas de oro o más de 700 de bronce?

In [ ]:
mas200oro_o_mas700bronce = medallas.loc[(medallas.Oro > 200)| (medallas.Plata > 1000)]
mas200oro_o_mas700bronce

               Unnamed: 0   Oro  Plata  Bronce
País
China                   1  1473    994     720
Japón                   2  1032   1037     985
Corea del Sur           3   745    663     827

Como vemos hay una columna que se llama Unnamed: 0 que no nos interesa. Eliminad esa columna.

In [ ]:
sin_unnamed = medallas.drop(['Unnamed: 0'], axis=1)
sin_unnamed

                  Oro  Plata  Bronce
País
China            1473    994     720
Japón            1032   1037     985
Corea del Sur     745    663     827
Irán              179    181     197
Kazajistán        155    158     224
India             154    202     315
Tailandia         132    175     278
Indonesia         112    131     240
China Taipéi       99    144     276
Corea del Norte    91    120     235

Cread una nueva columma que se llame "total" que sea el resultado de la suma de todas las medallas obtenidas por cada país.

In [ ]:
#si llamamos a con_total no nos devuelve nada. al insertar la columna nos lo sobreescribe y modifica sin_unnamed
#con_total = sin_unnamed.insert(3,"total",True)
#con_total

sin_unnamed.insert(3,"total",True)

In [ ]:
sin_unnamed ["total"] = (sin_unnamed["Oro"] + sin_unnamed["Plata"] + sin_unnamed["Bronce"])

In [ ]:
sin_unnamed

                  Oro  Plata  Bronce  total
País
China            1473    994     720   3187
Japón            1032   1037     985   3054
Corea del Sur     745    663     827   2235
Irán              179    181     197    557
Kazajistán        155    158     224    537
India             154    202     315    671
Tailandia         132    175     278    585
Indonesia         112    131     240    483
China Taipéi       99    144     276    519
Corea del Norte    91    120     235    446